# Importing Libaries and Data Sets

In [25]:
import pandas as pd

df = pd.read_csv("Orignal Data/Vaccination_Rates_by_Neighborhood.csv")
df2 = pd.read_csv("Orignal Data/LA_Median_Income_By_Neighborhood.csv")
print(len(df["CITY"].unique()))
df.head()

89

,CITY_TYPE,CITY,COMMUNITY,LABEL,City_Community,Cases,Case_Rate,Deaths,Death_Rate,Percent_of_People_with_1__Dose,Percent_of_People_Fully_Vaccinated
0,City,Agoura Hills,,City of Agoura Hills,City of Agoura Hills,4220,20208.0,22,105.0,0.85,0.80
1,City,Alhambra,,City of Alhambra,City of Alhambra,17044,19653.0,255,294.0,0.87,0.81
2,City,Arcadia,,City of Arcadia,City of Arcadia,8145,14103.0,165,286.0,0.91,0.84
3,City,Artesia,,City of Artesia,City of Artesia,4186,24924.0,88,524.0,0.87,0.80
4,City,Avalon,,City of Avalon,City of Avalon,63,1628.0,0,0.0,0.27,0.23

# Convert Dollar Values to Int

In [19]:
df2["MEDIAN INCOME"] = df2["MEDIAN INCOME"].str.replace('$', '', regex=False).str.replace(',', '', regex=False)
df2["MEDIAN INCOME"] = df2["MEDIAN INCOME"].astype(int)
df2.head()

   rank       NEIGHBORHOOD  MEDIAN INCOME
0     1            Bel-Air         207938
1     2       Hidden Hills         203199
2     3      Rolling Hills         184777
3     4      Beverly Crest         169282
4     5  Pacific Palisades         168008

# Find What "Neighborhoods" Are In Both Datasets

In [20]:
#Find "Neighborhoods" found in both datasets
common_values = set(df2["NEIGHBORHOOD"].unique().tolist()).intersection(set(df["CITY"].unique().tolist()))

#Count the number of common values
count = len(common_values)
print(count)
print(common_values)

86
{'Bell', 'Hawaiian Gardens', 'Santa Fe Springs', 'Lomita', 'Rolling Hills Estates', 'Arcadia', 'Pico Rivera', 'South El Monte', 'Downey', 'Agoura Hills', 'Westlake Village', 'Calabasas', 'Santa Monica', 'Diamond Bar', 'Cerritos', 'Monterey Park', 'Alhambra', 'El Segundo', 'Glendora', 'Temple City', 'Sierra Madre', 'Commerce', 'Claremont', 'Pomona', 'Monrovia', 'Compton', 'Hermosa Beach', 'San Dimas', 'La Mirada', 'Rolling Hills', 'Santa Clarita', 'Carson', 'West Hollywood', 'Azusa', 'Manhattan Beach', 'Glendale', 'Cudahy', 'Gardena', 'Bradbury', 'Beverly Hills', 'Montebello', 'Burbank', 'Long Beach', 'Covina', 'Hawthorne', 'South Pasadena', 'West Covina', 'Walnut', 'Malibu', 'Lynwood', 'South Gate', 'Palos Verdes Estates', 'Artesia', 'Signal Hill', 'Industry', 'Whittier', 'Inglewood', 'Huntington Park', 'Norwalk', 'Lawndale', 'Bell Gardens', 'La Verne', 'Baldwin Park', 'La Habra Heights', 'San Fernando', 'Maywood', 'Torrance', 'Vernon', 'San Gabriel', 'Culver City', 'Pasadena', 'Hidden Hills', 'Irwindale', 'Duarte', 'Bellflower', 'La Puente', 'Lakewood', 'Rosemead', 'Redondo Beach', 'Paramount', 'Avalon', 'Rancho Palos Verdes', 'Lancaster', 'El Monte', 'Palmdale', 'San Marino'}

# Determine What "Neighborhoods" Are In The Vaccination Dataset, But Not In the Income Dataset

In [21]:
# Convert coumns to sets
set1 = set(df["CITY"].unique().tolist())

# Find values not in both sets
values_not_in_both = list(set1.symmetric_difference(common_values))

# Print the list of values not found in both lists
print(values_not_in_both)

['La Canada Flintridge', 'Los Angeles', 'Unincorporated']

# Trim Both Datasets So They Only have "Neighborhoods" That Are In Common

In [22]:
#Filter Vaccination Dataset
df = df[df['CITY'].isin(common_values)]

#Filter Income Dataset
df2 = df2[df2['NEIGHBORHOOD'].isin(common_values)]

#Print the sizes of the filtered DataFrame
print(len(df))
print(len(df2))

86
86

# Add "Income Level" Column (High, Medium, Low)

In [23]:
#add income levels
# high is 75675 and above
# medium is 52146 and above

#bins and labels of the ranges
bins = [0, 52146, 75675, float('inf')]
labels = ['low', 'medium', 'high']

#Apply bins to df2 and make a column for "income level"
df2['income level'] = pd.cut(df2['MEDIAN INCOME'], bins=bins, labels=labels, right=False)
df2.head()

   rank           NEIGHBORHOOD  MEDIAN INCOME income level
1     2           Hidden Hills         203199         high
2     3          Rolling Hills         184777         high
5     6   Palos Verdes Estates         167344         high
6     7             San Marino         158855         high
8     9  Rolling Hills Estates         145628         high

# Save CSVs

In [24]:
# Save the modified DataFrame as a CSV file
df.to_csv('Cleaned Data/Vaccination_Rates.csv', index=False)
df2.to_csv('Cleaned Data/Median_Income.csv', index=False)